nordic-auko/nRF5-ble-timesync-demo/nRF5_SDK_16.0.0_98a08e2/examples/ble_central/ble_app_uart_c/main.c
    init.evt_handler   = ble_nus_c_evt_handler;
    init.error_handler = nus_error_handler;
    init.p_gatt_queue  = &m_ble_gatt_queue;

    err_code = ble_nus_c_init(&m_ble_nus_c, &init);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing buttons and leds. */
static void buttons_leds_init(void)
{
    ret_code_t err_code;
    bsp_event_t startup_event;

    err_code = bsp_init(BSP_INIT_LEDS | BSP_INIT_BUTTONS, bsp_event_handler);
    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the timer. */
static void timer_init(void)
{
    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the nrf log module. */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


/** @brief Function for initializing the database discovery module. */
static void db_discovery_init(void)
{
    ble_db_discovery_init_t db_init;

    memset(&db_init, 0, sizeof(ble_db_discovery_init_t));

    db_init.evt_handler  = db_disc_handler;
    db_init.p_gatt_queue = &m_ble_gatt_queue;

    ret_code_t err_code = ble_db_discovery_init(&db_init);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details Handles any pending log operations, then sleeps until the next event occurs.
 */
static void idle_state_handle(void)
{
    if (NRF_LOG_PROCESS() == false)
    {
        nrf_pwr_mgmt_run();
    }
}

static void ts_evt_callback(const ts_trigger_evt_t* evt)
{
	ASSERT(evt);

	NRF_LOG_INFO("Trigger Status: %d | %d | %d",
						evt->startTick,
						evt->targetTick,
						evt->syncPacketCnt);

	/*
	 * Set a new trigger
	 */
	uint32_t err_code = ts_set_trigger(evt->targetTick + 500, nrf_gpiote_task_addr_get(NRF_GPIOTE_TASKS_OUT_3), ts_evt_callback);
	APP_ERROR_CHECK(err_code);
}

static void sync_timer_init(void)
{
    uint32_t       err_code;
    ts_init_t    init_ts;

    // Debug pin:
    // nRF52-DK (PCA10040) Toggle P0.24 from sync timer to allow pin measurement
    // nRF52840-DK (PCA10056) Toggle P1.14 from sync timer to allow pin measurement
#if defined(BOARD_PCA10040)
    nrf_gpiote_task_configure(3, NRF_GPIO_PIN_MAP(0, 24), NRF_GPIOTE_POLARITY_TOGGLE, NRF_GPIOTE_INITIAL_VALUE_LOW);
    nrf_gpiote_task_enable(3);
#elif defined(BOARD_PCA10056)
    nrf_gpiote_task_configure(3, NRF_GPIO_PIN_MAP(1, 14), NRF_GPIOTE_POLARITY_TOGGLE, NRF_GPIOTE_INITIAL_VALUE_LOW);
    nrf_gpiote_task_enable(3);
#else
#warning Debug pin not set
#endif

//    nrf_ppi_channel_endpoint_setup(
//        NRF_PPI_CHANNEL0,
//        (uint32_t) nrf_timer_event_address_get(NRF_TIMER3, NRF_TIMER_EVENT_COMPARE4),
//        nrf_gpiote_task_addr_get(NRF_GPIOTE_TASKS_OUT_3));
//    nrf_ppi_channel_enable(NRF_PPI_CHANNEL0);

    init_ts.high_freq_timer[0] = NRF_TIMER2;
    init_ts.high_freq_timer[1] = NRF_TIMER3;
//    ts_params.rtc             = NRF_RTC1;
    init_ts.egu             = NRF_EGU3;
    init_ts.egu_irq_type    = SWI3_EGU3_IRQn;

    err_code = ts_init(&init_ts);
    APP_ERROR_CHECK(err_code);

	ts_rf_config_t rf_config =
	{
		.rf_chn = 125,	/* For testing purposes */
		.rf_addr = { 0xDE, 0xAD, 0xBE, 0xEF, 0x19 }
	};

    err_code = ts_enable(&rf_config);
    APP_ERROR_CHECK(err_code);

    err_code = ts_set_trigger(500, nrf_gpiote_task_addr_get(NRF_GPIOTE_TASKS_OUT_3), ts_evt_callback);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_INFO("Started listening for beacons.\r\n");
    NRF_LOG_INFO("Press Button 1 to start sending sync beacons\r\n");
}

int main(void)
{
    // Initialize.
    log_init();
    timer_init();
    uart_init();
    buttons_leds_init();
    db_discovery_init();
    power_management_init();
    ble_stack_init();
    gatt_init();
    nus_c_init();
    scan_init();

    sync_timer_init();

    // Start execution.
    printf("BLE UART central example started.\r\n");
    NRF_LOG_INFO("BLE UART central example started.");
    scan_start();

    // Enter main loop.
    for (;;)
    {
        idle_state_handle();
    }
}
